ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M480/device/StdDriver/m480_sdh.c
/**************************************************************************//**
 * @file     SDH.c
 * @version  V1.00
 * $Revision: 13 $
 * $Date: 16/07/01 9:02a $
 * @brief    M480 SDH driver source file
 *
 * @note
 * @copyright (C) 2016 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "M480.h"

/** @addtogroup M480_Device_Driver M480 Device Driver
  @{
*/

/** @addtogroup M480_SDH_Driver SDH Driver
  @{
*/


/** @addtogroup M480_SDH_EXPORTED_FUNCTIONS SDH Exported Functions
  @{
*/
#define SDH_BLOCK_SIZE   512ul

/** @cond HIDDEN_SYMBOLS */

/* global variables */
/* For response R3 (such as ACMD41, CRC-7 is invalid; but SD controller will still */
/* calculate CRC-7 and get an error result, software should ignore this error and clear SDISR [CRC_IF] flag */
/* _sd_uR3_CMD is the flag for it. 1 means software should ignore CRC-7 error */
uint32_t _SDH_uR3_CMD = 0ul;
uint32_t _SDH_uR7_CMD = 0ul;
uint8_t volatile _SDH_SDDataReady = FALSE;

uint32_t _SDH_ReferenceClock;

#if defined (__CC_ARM)
__align(4) uint8_t _SDH_ucSDHCBuffer[512];
#elif defined ( __ICCARM__ ) /*!< IAR Compiler */
#pragma data_alignment = 4
uint8_t _SDH_ucSDHCBuffer[512];
#elif defined ( __GNUC__ )
uint8_t _SDH_ucSDHCBuffer[512] __attribute__((aligned(4)));
#endif

int SDH_ok = 0;

SDH_INFO_T SD0, SD1;

void SDH_CheckRB(SDH_T *sdh)
{
    while (1) {
        sdh->CTL |= SDH_CTL_CLK8OEN_Msk;
        while ((sdh->CTL & SDH_CTL_CLK8OEN_Msk) == SDH_CTL_CLK8OEN_Msk) {
        }
        if ((sdh->INTSTS & SDH_INTSTS_DAT0STS_Msk) == SDH_INTSTS_DAT0STS_Msk) {
            break;
        }
    }
}


uint32_t SDH_SDCommand(SDH_T *sdh, uint32_t ucCmd, uint32_t uArg)
{
    volatile uint32_t buf, val = 0ul;
    SDH_INFO_T *pSD;

    if (sdh == SDH0) {
        pSD = &SD0;
    } else {
        pSD = &SD1;
    }

    sdh->CMDARG = uArg;
    buf = (sdh->CTL & (~SDH_CTL_CMDCODE_Msk)) | (ucCmd << 8ul) | (SDH_CTL_COEN_Msk);
    sdh->CTL = buf;

    while ((sdh->CTL & SDH_CTL_COEN_Msk) == SDH_CTL_COEN_Msk) {
        if (pSD->IsCardInsert == 0ul) {
            val = SDH_NO_SD_CARD;
        }
    }
    return val;
}


uint32_t SDH_SDCmdAndRsp(SDH_T *sdh, uint32_t ucCmd, uint32_t uArg, uint32_t ntickCount)
{
    volatile uint32_t buf;
    SDH_INFO_T *pSD;

    if (sdh == SDH0) {
        pSD = &SD0;
    } else {
        pSD = &SD1;
    }

    sdh->CMDARG = uArg;
    buf = (sdh->CTL & (~SDH_CTL_CMDCODE_Msk)) | (ucCmd << 8ul) | (SDH_CTL_COEN_Msk | SDH_CTL_RIEN_Msk);
    sdh->CTL = buf;

    if (ntickCount > 0ul) {
        while ((sdh->CTL & SDH_CTL_RIEN_Msk) == SDH_CTL_RIEN_Msk) {
            if (ntickCount-- == 0ul) {
                sdh->CTL |= SDH_CTL_CTLRST_Msk; /* reset SD engine */
                return 2ul;
            }
            if (pSD->IsCardInsert == FALSE) {
                return SDH_NO_SD_CARD;
            }
        }
    } else {
        while ((sdh->CTL & SDH_CTL_RIEN_Msk) == SDH_CTL_RIEN_Msk) {
            if (pSD->IsCardInsert == FALSE) {
                return SDH_NO_SD_CARD;
            }
        }
    }

    if (_SDH_uR7_CMD) {
        uint32_t tmp0 = 0ul, tmp1 = 0ul;
        tmp1 = sdh->RESP1 & 0xfful;
        tmp0 = sdh->RESP0 & 0xful;
        if ((tmp1 != 0x55ul) && (tmp0 != 0x01ul)) {
            _SDH_uR7_CMD = 0ul;
            return SDH_CMD8_ERROR;
        }
    }

    if (!_SDH_uR3_CMD) {
        if ((sdh->INTSTS & SDH_INTSTS_CRC7_Msk) == SDH_INTSTS_CRC7_Msk) {   /* check CRC7 */
            return Successful;
        } else {
            return SDH_CRC7_ERROR;
        }
    } else {
        /* ignore CRC error for R3 case */
        _SDH_uR3_CMD = 0ul;
        sdh->INTSTS = SDH_INTSTS_CRCIF_Msk;
        return Successful;
    }
}


uint32_t SDH_Swap32(uint32_t val)
{
    uint32_t buf;

    buf = val;
    val <<= 24;
    val |= (buf << 8) & 0xff0000ul;
    val |= (buf >> 8) & 0xff00ul;
    val |= (buf >> 24) & 0xfful;
    return val;
}

/* Get 16 bytes CID or CSD */
uint32_t SDH_SDCmdAndRsp2(SDH_T *sdh, uint32_t ucCmd, uint32_t uArg, uint32_t puR2ptr[])
{
    uint32_t i, buf;
    uint32_t tmpBuf[5];
    SDH_INFO_T *pSD;

    if (sdh == SDH0) {
        pSD = &SD0;
    } else {
        pSD = &SD1;
    }

    sdh->CMDARG = uArg;
    buf = (sdh->CTL & (~SDH_CTL_CMDCODE_Msk)) | (ucCmd << 8) | (SDH_CTL_COEN_Msk | SDH_CTL_R2EN_Msk);
    sdh->CTL = buf;

    while ((sdh->CTL & SDH_CTL_R2EN_Msk) == SDH_CTL_R2EN_Msk) {
        if (pSD->IsCardInsert == FALSE) {
            return SDH_NO_SD_CARD;
        }
    }

    if ((sdh->INTSTS & SDH_INTSTS_CRC7_Msk) == SDH_INTSTS_CRC7_Msk) {
        for (i = 0ul; i < 5ul; i++) {
            tmpBuf[i] = SDH_Swap32(sdh->FB[i]);
        }
        for (i = 0ul; i < 4ul; i++) {
            puR2ptr[i] = ((tmpBuf[i] & 0x00fffffful) << 8) | ((tmpBuf[i + 1ul] & 0xff000000ul) >> 24);
        }
    } else {
        return SDH_CRC7_ERROR;
    }
    return Successful;
}


uint32_t SDH_SDCmdAndRspDataIn(SDH_T *sdh, uint32_t ucCmd, uint32_t uArg)
{
    volatile uint32_t buf;
    SDH_INFO_T *pSD;

    if (sdh == SDH0) {
        pSD = &SD0;
    } else {
        pSD = &SD1;
    }

    sdh->CMDARG = uArg;
    buf = (sdh->CTL & (~SDH_CTL_CMDCODE_Msk)) | (ucCmd << 8ul) |
          (SDH_CTL_COEN_Msk | SDH_CTL_RIEN_Msk | SDH_CTL_DIEN_Msk);

    sdh->CTL = buf;

    while ((sdh->CTL & SDH_CTL_RIEN_Msk) == SDH_CTL_RIEN_Msk) {
        if (pSD->IsCardInsert == FALSE) {
            return SDH_NO_SD_CARD;
        }
    }

    while ((sdh->CTL & SDH_CTL_DIEN_Msk) == SDH_CTL_DIEN_Msk) {
        if (pSD->IsCardInsert == FALSE) {
            return SDH_NO_SD_CARD;
        }
    }

    if ((sdh->INTSTS & SDH_INTSTS_CRC7_Msk) != SDH_INTSTS_CRC7_Msk) {
        /* check CRC7 */
        return SDH_CRC7_ERROR;
    }

    if ((sdh->INTSTS & SDH_INTSTS_CRC16_Msk) != SDH_INTSTS_CRC16_Msk) {
        /* check CRC16 */
        return SDH_CRC16_ERROR;
    }
    return 0ul;
}

/* there are 8 bits for divider0, maximum is 256 */
#define SDH_CLK_DIV0_MAX     256ul

void SDH_Set_clock(SDH_T *sdh, uint32_t sd_clock_khz)
{
    uint32_t rate, div1;
    static uint32_t u32SD_ClkSrc = 0ul, u32SD_PwrCtl = 0ul;

    SYS_UnlockReg();

    /* initial state, clock source use HIRC */
    if (sd_clock_khz <= 400ul) {
        u32SD_PwrCtl = CLK->PWRCTL;
        if ((u32SD_PwrCtl & CLK_PWRCTL_HIRCEN_Msk) != 0x4ul) {
            CLK->PWRCTL |= CLK_PWRCTL_HIRCEN_Msk;
        }

        if (sdh == SDH0) {
            u32SD_ClkSrc = (CLK->CLKSEL0 & CLK_CLKSEL0_SDH0SEL_Msk);
            CLK->CLKSEL0 = (CLK->CLKSEL0 & ~CLK_CLKSEL0_SDH0SEL_Msk) | CLK_CLKSEL0_SDH0SEL_HIRC;
        } else {
            u32SD_ClkSrc = (CLK->CLKSEL0 & CLK_CLKSEL0_SDH1SEL_Msk);
            CLK->CLKSEL0 = (CLK->CLKSEL0 & ~CLK_CLKSEL0_SDH1SEL_Msk) | CLK_CLKSEL0_SDH1SEL_HIRC;
        }
        _SDH_ReferenceClock = (__HIRC / 1000ul);
    }
    /* transfer state, clock source use sys_init() */
    else {
        CLK->PWRCTL = u32SD_PwrCtl;
        if (sdh == SDH0) {
            CLK->CLKSEL0 = (CLK->CLKSEL0 & ~CLK_CLKSEL0_SDH0SEL_Msk) | u32SD_ClkSrc;
            if (u32SD_ClkSrc == CLK_CLKSEL0_SDH0SEL_HXT) {
                _SDH_ReferenceClock = (CLK_GetHXTFreq() / 1000ul);
            } else if (u32SD_ClkSrc == CLK_CLKSEL0_SDH0SEL_HIRC) {
                _SDH_ReferenceClock = (__HIRC / 1000ul);
            } else if (u32SD_ClkSrc == CLK_CLKSEL0_SDH0SEL_PLL) {
                _SDH_ReferenceClock = (CLK_GetPLLClockFreq() / 1000ul);
            } else if (u32SD_ClkSrc == CLK_CLKSEL0_SDH0SEL_HCLK) {
                _SDH_ReferenceClock = (CLK_GetHCLKFreq() / 1000ul);
            }
        } else {
            CLK->CLKSEL0 = (CLK->CLKSEL0 & ~CLK_CLKSEL0_SDH1SEL_Msk) | u32SD_ClkSrc;
            if (u32SD_ClkSrc == CLK_CLKSEL0_SDH1SEL_HXT) {
                _SDH_ReferenceClock = (CLK_GetHXTFreq() / 1000ul);
            } else if (u32SD_ClkSrc == CLK_CLKSEL0_SDH1SEL_HIRC) {
                _SDH_ReferenceClock = (__HIRC / 1000ul);
            } else if (u32SD_ClkSrc == CLK_CLKSEL0_SDH1SEL_PLL) {
                _SDH_ReferenceClock = (CLK_GetPLLClockFreq() / 1000ul);
            } else if (u32SD_ClkSrc == CLK_CLKSEL0_SDH1SEL_HCLK) {
                _SDH_ReferenceClock = (CLK_GetHCLKFreq() / 1000ul);
            }
        }

        if (sd_clock_khz >= 50000ul) {
            sd_clock_khz = 50000ul;
        }
    }
    rate = _SDH_ReferenceClock / sd_clock_khz;

    /* choose slower clock if system clock cannot divisible by wanted clock */
    if ((_SDH_ReferenceClock % sd_clock_khz) != 0ul) {
        rate++;
    }

    if (rate >= SDH_CLK_DIV0_MAX) {
        rate = SDH_CLK_DIV0_MAX;
    }

    /*--- calculate the second divider CLKDIV0[SDHOST_N]*/
    div1 = (rate - 1ul) & 0xFFul;

    /*--- setup register */
    if (sdh == SDH0) {
        CLK->CLKDIV0 &= ~CLK_CLKDIV0_SDH0DIV_Msk;
        CLK->CLKDIV0 |= (div1 << CLK_CLKDIV0_SDH0DIV_Pos);
    } else {
        CLK->CLKDIV3 &= ~CLK_CLKDIV3_SDH1DIV_Msk;
        CLK->CLKDIV3 |= (div1 << CLK_CLKDIV3_SDH1DIV_Pos);
    }
    return;
}

