ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M480/device/StdDriver/m480_sdh.c
uint32_t SDH_CardDetection(SDH_T *sdh)
{
    uint32_t i, val = TRUE;
    SDH_INFO_T *pSD;

    if (sdh == SDH0) {
        pSD = &SD0;
    } else {
        pSD = &SD1;
    }


    if ((sdh->INTEN & SDH_INTEN_CDSRC_Msk) == SDH_INTEN_CDSRC_Msk) { /* Card detect pin from GPIO */
        if ((sdh->INTSTS & SDH_INTSTS_CDSTS_Msk) == SDH_INTSTS_CDSTS_Msk) { /* Card remove */
            pSD->IsCardInsert = (uint8_t)FALSE;
            val = FALSE;
        } else {
            pSD->IsCardInsert = (uint8_t)TRUE;
        }
    } else if ((sdh->INTEN & SDH_INTEN_CDSRC_Msk) != SDH_INTEN_CDSRC_Msk) {
        sdh->CTL |= SDH_CTL_CLKKEEP_Msk;
        for (i = 0ul; i < 5000ul; i++) {
        }

        if ((sdh->INTSTS & SDH_INTSTS_CDSTS_Msk) == SDH_INTSTS_CDSTS_Msk) { /* Card insert */
            pSD->IsCardInsert = (uint8_t)TRUE;
        } else {
            pSD->IsCardInsert = (uint8_t)FALSE;
            val = FALSE;
        }

        sdh->CTL &= ~SDH_CTL_CLKKEEP_Msk;
    }

    return val;
}

uint32_t SDH_Init(SDH_T *sdh)
{
    uint32_t volatile i, status;
    unsigned int resp;
    uint32_t CIDBuffer[4];
    uint32_t volatile u32CmdTimeOut;
    SDH_INFO_T *pSD;

    if (sdh == SDH0) {
        pSD = &SD0;
    } else {
        pSD = &SD1;
    }

    /* set the clock to 300KHz */
    SDH_Set_clock(sdh, 300ul);

    /* power ON 74 clock */
    sdh->CTL |= SDH_CTL_CLK74OEN_Msk;

    while ((sdh->CTL & SDH_CTL_CLK74OEN_Msk) == SDH_CTL_CLK74OEN_Msk) {
        if (pSD->IsCardInsert == FALSE) {
            return SDH_NO_SD_CARD;
        }
    }

    SDH_SDCommand(sdh, 0ul, 0ul);        /* reset all cards */
    for (i = 0x1000ul; i > 0ul; i--) {
    }

    /* initial SDHC */
    _SDH_uR7_CMD = 1ul;
    u32CmdTimeOut = 0xFFFFFul;

    i = SDH_SDCmdAndRsp(sdh, 8ul, 0x00000155ul, u32CmdTimeOut);
    if (i == Successful) {
        /* SD 2.0 */
        SDH_SDCmdAndRsp(sdh, 55ul, 0x00ul, u32CmdTimeOut);
        _SDH_uR3_CMD = 1ul;
        SDH_SDCmdAndRsp(sdh, 41ul, 0x40ff8000ul, u32CmdTimeOut); /* 2.7v-3.6v */
        resp = sdh->RESP0;

        while ((resp & 0x00800000ul) != 0x00800000ul) {      /* check if card is ready */
            SDH_SDCmdAndRsp(sdh, 55ul, 0x00ul, u32CmdTimeOut);
            _SDH_uR3_CMD = 1ul;
            SDH_SDCmdAndRsp(sdh, 41ul, 0x40ff8000ul, u32CmdTimeOut); /* 3.0v-3.4v */
            resp = sdh->RESP0;
        }
        if ((resp & 0x00400000ul) == 0x00400000ul) {
            pSD->CardType = SDH_TYPE_SD_HIGH;
        } else {
            pSD->CardType = SDH_TYPE_SD_LOW;
        }
    } else {
        /* SD 1.1 */
        SDH_SDCommand(sdh, 0ul, 0ul);        /* reset all cards */
        for (i = 0x100ul; i > 0ul; i--) {
        }

        i = SDH_SDCmdAndRsp(sdh, 55ul, 0x00ul, u32CmdTimeOut);
        if (i == 2ul) {   /* MMC memory */

            SDH_SDCommand(sdh, 0ul, 0ul);        /* reset */
            for (i = 0x100ul; i > 0ul; i--) {
            }

            _SDH_uR3_CMD = 1ul;

            if (SDH_SDCmdAndRsp(sdh, 1ul, 0x40ff8000ul, u32CmdTimeOut) != 2ul) {  /* eMMC memory */
                resp = sdh->RESP0;
                while ((resp & 0x00800000ul) != 0x00800000ul) {
                    /* check if card is ready */
                    _SDH_uR3_CMD = 1ul;

                    SDH_SDCmdAndRsp(sdh, 1ul, 0x40ff8000ul, u32CmdTimeOut);      /* high voltage */
                    resp = sdh->RESP0;
                }

                if ((resp & 0x00400000ul) == 0x00400000ul) {
                    pSD->CardType = SDH_TYPE_EMMC;
                } else {
                    pSD->CardType = SDH_TYPE_MMC;
                }
            } else {
                pSD->CardType = SDH_TYPE_UNKNOWN;
                return SDH_ERR_DEVICE;
            }
        } else if (i == 0ul) { /* SD Memory */
            _SDH_uR3_CMD = 1ul;
            SDH_SDCmdAndRsp(sdh, 41ul, 0x00ff8000ul, u32CmdTimeOut); /* 3.0v-3.4v */
            resp = sdh->RESP0;
            while ((resp & 0x00800000ul) != 0x00800000ul) {      /* check if card is ready */
                SDH_SDCmdAndRsp(sdh, 55ul, 0x00ul, u32CmdTimeOut);
                _SDH_uR3_CMD = 1ul;
                SDH_SDCmdAndRsp(sdh, 41ul, 0x00ff8000ul, u32CmdTimeOut); /* 3.0v-3.4v */
                resp = sdh->RESP0;
            }
            pSD->CardType = SDH_TYPE_SD_LOW;
        } else {
            pSD->CardType = SDH_TYPE_UNKNOWN;
            return SDH_INIT_ERROR;
        }
    }

    if (pSD->CardType != SDH_TYPE_UNKNOWN) {
        SDH_SDCmdAndRsp2(sdh, 2ul, 0x00ul, CIDBuffer);
        if ((pSD->CardType == SDH_TYPE_MMC) || (pSD->CardType == SDH_TYPE_EMMC)) {
            if ((status = SDH_SDCmdAndRsp(sdh, 3ul, 0x10000ul, 0ul)) != Successful) {   /* set RCA */
                return status;
            }
            pSD->RCA = 0x10000ul;
        } else {
            if ((status = SDH_SDCmdAndRsp(sdh, 3ul, 0x00ul, 0ul)) != Successful) {     /* get RCA */
                return status;
            } else {
                pSD->RCA = (sdh->RESP0 << 8) & 0xffff0000;
            }
        }
    }
    return Successful;
}


uint32_t SDH_SwitchToHighSpeed(SDH_T *sdh, SDH_INFO_T *pSD)
{
    uint32_t volatile status = 0ul;
    uint16_t current_comsumption, busy_status0;

    sdh->DMASA = (uint32_t)_SDH_ucSDHCBuffer;
    sdh->BLEN = 63ul;

    if ((status = SDH_SDCmdAndRspDataIn(sdh, 6ul, 0x00ffff01ul)) != Successful) {
        return Fail;
    }

    current_comsumption = (uint16_t)_SDH_ucSDHCBuffer[0] << 8;
    current_comsumption |= (uint16_t)_SDH_ucSDHCBuffer[1];
    if (!current_comsumption) {
        return Fail;
    }

    busy_status0 = (uint16_t)_SDH_ucSDHCBuffer[28] << 8;
    busy_status0 |= (uint16_t)_SDH_ucSDHCBuffer[29];

    if (!busy_status0) { /* function ready */
        sdh->DMASA = (uint32_t)_SDH_ucSDHCBuffer;
        sdh->BLEN = 63ul;    /* 512 bit */

        if ((status = SDH_SDCmdAndRspDataIn(sdh, 6ul, 0x80ffff01ul)) != Successful) {
            return Fail;
        }

        /* function change timing: 8 clocks */
        sdh->CTL |= SDH_CTL_CLK8OEN_Msk;
        while ((sdh->CTL & SDH_CTL_CLK8OEN_Msk) == SDH_CTL_CLK8OEN_Msk) {
        }

        current_comsumption = (uint16_t)_SDH_ucSDHCBuffer[0] << 8;
        current_comsumption |= (uint16_t)_SDH_ucSDHCBuffer[1];
        if (!current_comsumption) {
            return Fail;
        }

        return Successful;
    } else {
        return Fail;
    }
}


uint32_t SDH_SelectCardType(SDH_T *sdh)
{
    uint32_t volatile status = 0ul;
    uint32_t param;
    SDH_INFO_T *pSD;

    if (sdh == SDH0) {
        pSD = &SD0;
    } else {
        pSD = &SD1;
    }

    if ((status = SDH_SDCmdAndRsp(sdh, 7ul, pSD->RCA, 0ul)) != Successful) {
        return status;
    }

    SDH_CheckRB(sdh);

    /* if SD card set 4bit */
    if (pSD->CardType == SDH_TYPE_SD_HIGH) {
        sdh->DMASA = (uint32_t)_SDH_ucSDHCBuffer;
        sdh->BLEN = 0x07ul;  /* 64 bit */

        if ((status = SDH_SDCmdAndRsp(sdh, 55ul, pSD->RCA, 0ul)) != Successful) {
            return status;
        }
        if ((status = SDH_SDCmdAndRspDataIn(sdh, 51ul, 0x00ul)) != Successful) {
            return status;
        }

        if ((_SDH_ucSDHCBuffer[0] & 0xful) == 0x2ul) {
//        if ((_SDH_ucSDHCBuffer[0] & 0xful) == 0xful) {
            status = SDH_SwitchToHighSpeed(sdh, pSD);
            if (status == Successful) {
                /* divider */
                SDH_Set_clock(sdh, SDHC_FREQ);
            }
        }

        if ((status = SDH_SDCmdAndRsp(sdh, 55ul, pSD->RCA, 0ul)) != Successful) {
            return status;
        }
        if ((status = SDH_SDCmdAndRsp(sdh, 6ul, 0x02ul, 0ul)) != Successful) { /* set bus width */
            return status;
        }

        sdh->CTL |= SDH_CTL_DBW_Msk;
    } else if (pSD->CardType == SDH_TYPE_SD_LOW) {
        sdh->DMASA = (uint32_t) _SDH_ucSDHCBuffer;
        sdh->BLEN = 0x07ul;

        if ((status = SDH_SDCmdAndRsp(sdh, 55ul, pSD->RCA, 0ul)) != Successful) {
            return status;
        }
        if ((status = SDH_SDCmdAndRspDataIn(sdh, 51ul, 0x00ul)) != Successful) {
            return status;
        }

